In [4]:
import pandas as pd

In [5]:
df = pd.read_csv('../data/salaries_aula_1_processado.csv')

In [6]:
df.head()

,ano,senioridade,contrato,cargo,salario,moeda,usd,residencia,remoto,empresa,tamanho_empresa
0,2025.0,Senior,Tempo Integral,Solutions Engineer,214000,USD,214000,US,Remoto,US,Media
1,2025.0,Senior,Tempo Integral,Solutions Engineer,136000,USD,136000,US,Remoto,US,Media
2,2025.0,Pleno,Tempo Integral,Data Engineer,158800,USD,158800,AU,Presencial,AU,Media
3,2025.0,Pleno,Tempo Integral,Data Engineer,139200,USD,139200,AU,Presencial,AU,Media
4,2025.0,Junior,Tempo Integral,Data Engineer,90000,USD,90000,US,Presencial,US,Media

In [7]:
# Verifica se existe valores nulos (Mostra as 5 primeiras e últimas linhas do arquivo)
df.isnull()

,ano,senioridade,contrato,cargo,salario,moeda,usd,residencia,remoto,empresa,tamanho_empresa
0,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...
133344,False,False,False,False,False,False,False,False,False,False,False
133345,False,False,False,False,False,False,False,False,False,False,False
133346,False,False,False,False,False,False,False,False,False,False,False
133347,False,False,False,False,False,False,False,False,False,False,False
133348,False,False,False,False,False,False,False,False,False,False,False

In [8]:
# Soma a quantidade de linhas com valor NULO e mostra por coluna o total
df.isnull().sum()

ano                10
senioridade         0
contrato            0
cargo               0
salario             0
moeda               0
usd                 0
residencia          0
remoto              0
empresa             0
tamanho_empresa     0
dtype: int64

In [9]:
# Mostra cada valor único de uma determinada coluna
df["ano"].unique()

array([2025.,   nan, 2024., 2022., 2023., 2020., 2021.])

In [10]:
# Mostra apenas as linhas que tem a informação NULL
df[df.isnull().any(axis=1)]

,ano,senioridade,contrato,cargo,salario,moeda,usd,residencia,remoto,empresa,tamanho_empresa
5588,NaN,Senior,Tempo Integral,Product Manager,184500,USD,184500,US,Presencial,US,Media
59692,NaN,Pleno,Tempo Integral,Engineer,110000,USD,110000,DE,Presencial,DE,Media
59710,NaN,Junior,Tempo Integral,Data Scientist,208800,USD,208800,US,Presencial,US,Media
59759,NaN,Senior,Tempo Integral,Software Engineer,135000,USD,135000,US,Presencial,US,Media
59789,NaN,Senior,Tempo Integral,Engineer,112000,USD,112000,US,Presencial,US,Media
131000,NaN,Senior,Tempo Integral,Machine Learning Engineer,163800,USD,163800,US,Presencial,US,Media
131006,NaN,Senior,Tempo Integral,Data Analytics Manager,204500,USD,204500,US,Presencial,US,Media
133054,NaN,Junior,Tempo Integral,Data Scientist,40000,USD,40000,JP,Remoto,MY,Grande
133281,NaN,Pleno,Tempo Integral,Machine Learning Engineer,180000,PLN,46597,PL,Remoto,PL,Grande
133317,NaN,Pleno,Tempo Integral,Data Scientist,130000,USD,130000,US,Hibrido,US,Grande

In [11]:
import numpy as np

# Criação de um DataFrame de exemplo
df_salarios = pd.DataFrame({
    "nome": ["Any", "Felipe", "Sergio", "Gabriela", "Jussara"],
    "salario": [4000, np.nan, 5000, np.nan, 100000]
})

# Substitue os NULOS pelas médias com arredondamento
df_salarios["salario_media"] = df_salarios["salario"].fillna(df_salarios["salario"].mean().round(2))

# Substitue os NULOS pela mediana dos salários
df_salarios["salario_mediana"] = df_salarios["salario"].fillna(df_salarios["salario"].median())

df_salarios

       nome   salario  salario_media  salario_mediana
0       Any    4000.0        4000.00           4000.0
1    Felipe       NaN       36333.33           5000.0
2    Sergio    5000.0        5000.00           5000.0
3  Gabriela       NaN       36333.33           5000.0
4   Jussara  100000.0      100000.00         100000.0

In [12]:
df_temperatura = pd.DataFrame({
    "dia": ["segunda", "terca", "quarta", "quinta", "sexta"],
    "temperatura": [30, np.nan, np.nan, 28, 27]
})

df_temperatura["preenchido_ffill"] = df_temperatura["temperatura"].ffill()

df_temperatura["preenchido_bfill"] = df_temperatura["temperatura"].bfill()


df_temperatura

       dia  temperatura  preenchido_ffill  preenchido_bfill
0  segunda         30.0              30.0              30.0
1    terca          NaN              30.0              28.0
2   quarta          NaN              30.0              28.0
3   quinta         28.0              28.0              28.0
4    sexta         27.0              27.0              27.0

In [13]:
df_cidades = pd.DataFrame ({
    "nome": ["Any", "Felipe", "Sergio", "Gabriela", "Jussara"],
    "cidade": ["São Paulo", np.nan, "Sorocaba", np.nan, "Campinas"]
})

df_cidades["cidade_preenchida"] = df_cidades["cidade"].fillna("Não informado")

df_cidades

       nome     cidade cidade_preenchida
0       Any  São Paulo         São Paulo
1    Felipe        NaN     Não informado
2    Sergio   Sorocaba          Sorocaba
3  Gabriela        NaN     Não informado
4   Jussara   Campinas          Campinas

In [14]:
df_limpo = df.dropna()

In [15]:
df_limpo.isnull().sum()

ano                0
senioridade        0
contrato           0
cargo              0
salario            0
moeda              0
usd                0
residencia         0
remoto             0
empresa            0
tamanho_empresa    0
dtype: int64

In [16]:
df_limpo.head()

,ano,senioridade,contrato,cargo,salario,moeda,usd,residencia,remoto,empresa,tamanho_empresa
0,2025.0,Senior,Tempo Integral,Solutions Engineer,214000,USD,214000,US,Remoto,US,Media
1,2025.0,Senior,Tempo Integral,Solutions Engineer,136000,USD,136000,US,Remoto,US,Media
2,2025.0,Pleno,Tempo Integral,Data Engineer,158800,USD,158800,AU,Presencial,AU,Media
3,2025.0,Pleno,Tempo Integral,Data Engineer,139200,USD,139200,AU,Presencial,AU,Media
4,2025.0,Junior,Tempo Integral,Data Engineer,90000,USD,90000,US,Presencial,US,Media

In [17]:
df_limpo.info()

<class 'pandas.DataFrame'>
Index: 133339 entries, 0 to 133348
Data columns (total 11 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   ano              133339 non-null  float64
 1   senioridade      133339 non-null  str
 2   contrato         133339 non-null  str
 3   cargo            133339 non-null  str
 4   salario          133339 non-null  int64
 5   moeda            133339 non-null  str
 6   usd              133339 non-null  int64
 7   residencia       133339 non-null  str
 8   remoto           133339 non-null  str
 9   empresa          133339 non-null  str
 10  tamanho_empresa  133339 non-null  str
dtypes: float64(1), int64(2), str(8)
memory usage: 12.2 MB

In [18]:
df_limpo = df_limpo.assign(ano= df_limpo["ano"].astype("int64"))
df_limpo

,ano,senioridade,contrato,cargo,salario,moeda,usd,residencia,remoto,empresa,tamanho_empresa
0,2025,Senior,Tempo Integral,Solutions Engineer,214000,USD,214000,US,Remoto,US,Media
1,2025,Senior,Tempo Integral,Solutions Engineer,136000,USD,136000,US,Remoto,US,Media
2,2025,Pleno,Tempo Integral,Data Engineer,158800,USD,158800,AU,Presencial,AU,Media
3,2025,Pleno,Tempo Integral,Data Engineer,139200,USD,139200,AU,Presencial,AU,Media
4,2025,Junior,Tempo Integral,Data Engineer,90000,USD,90000,US,Presencial,US,Media
...,...,...,...,...,...,...,...,...,...,...,...
133344,2020,Senior,Tempo Integral,Data Scientist,412000,USD,412000,US,Remoto,US,Grande
133345,2021,Pleno,Tempo Integral,Principal Data Scientist,151000,USD,151000,US,Remoto,US,Grande
133346,2020,Junior,Tempo Integral,Data Scientist,105000,USD,105000,US,Remoto,US,Pequena
133347,2020,Junior,Contrato,Business Data Analyst,100000,USD,100000,US,Remoto,US,Grande
133348,2021,Senior,Tempo Integral,Data Scientist,7000000,INR,94665,IN,Hibrido,IN,Grande

In [19]:
# Salvar o arquivo processado desse notebook
df_limpo.to_csv('../data/salaries_aula_2_processado.csv', index=False)
print("Checkpoint da Aula 02 salvo com sucesso!")

Checkpoint da Aula 02 salvo com sucesso!